Tekla.Structures.ModelInternal.ICDelegate.ExportBuildingHierarchyBuildingOperation(Tekla.Structures.ModelInternal.dotBuildingHierarchyBuildingOperation_t@)
DO NOT USE! For internal usage only!
Building:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportRunClashCheckWithOptions(System.Int32,System.Int32,System.Double,System.Int32)
DO NOT USE! For internal usage only!
betweenReferenceModels:
objectsInsideReferenceModels:
minDistance:
betweenParts:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.GetReferenceModelObjectFaces(Tekla.Structures.Internal.dotIdentifier_t@,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
pReferenceObjectIdentifier:
pClientId:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportModel(System.String,System.String,System.String,System.String,System.String,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32)
DO NOT USE! For internal usage only!
aOutPath:
aBasePointGuid:
aBasePointExportType:
aExportType:
aPropertiesPath:
selectedOnly:
assemblies:
allAssemblyParts:
parts:
rebars:
bolts:
welds:
surfaces:
surfaceTreatments:
grids:
spatialHierarchy:
pours: